exercise for aquisition

In [35]:
import pandas as pd
import numpy as np
from scipy import stats
import matplotlib as plt
import seaborn as sns
from pydataset import data
import statistics
import os
import warnings
warnings.filterwarnings('ignore')
df = data("dataset_name")

import prepare
import acquire
import env

Did you mean:
datasets, car.test.frame

In [2]:
df_iris = sns.load_dataset("iris")
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [3]:
df_iris.shape

(150, 5)

In [4]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [5]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [6]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [7]:
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [8]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [9]:
df_google.shape
df_google.columns
df_google.dtypes
df_google.info()
df_google.describe().T

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [10]:
for col in df_google.columns:
    if df_google[col].dtypes == "object":
        print(f'{col} has {df_google[col].nunique()} unique values')

Name has 891 unique values
Sex has 2 unique values
Ticket has 681 unique values
Cabin has 147 unique values
Embarked has 3 unique values

In [11]:
df_google.Survived.value_counts(dropna=False)
#0 perished
#1 survived

0    549
1    342
Name: Survived, dtype: int64

In [12]:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [13]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [14]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [15]:
df_excel = pd.read_excel("Excel_Exercises.xlsx")
df_excel_sample = df_excel.head(100)

In [16]:
df_excel.shape[0]

7049

In [17]:
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [18]:
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0.0,Yes,Yes,1.0,1.0,1.0,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0.0,No,No,2.0,1.0,0.0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0.0,No,No,1.0,2.0,0.0,Electronic check,73.9,280.85,Yes
3,0011-IGKFF,Male,1.0,Yes,No,1.0,2.0,0.0,Electronic check,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1.0,Yes,No,1.0,2.0,0.0,Mailed check,83.9,267.40,Yes

In [19]:
df_excel.describe().T

,count,mean,std,min,25%,50%,75%,max
is_senior_citizen,7049.0,0.162009,0.368485,0.00,0.0000,0.00,0.000,1.00
phone_service,7049.0,1.324585,0.642709,0.00,1.0000,1.00,2.000,2.00
internet_service,7049.0,1.222585,0.779068,0.00,1.0000,1.00,2.000,2.00
contract_type,7049.0,0.690878,0.833757,0.00,0.0000,0.00,1.000,2.00
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80

In [20]:
tstats = df_excel[["monthly_charges","total_charges"]].describe().T
tstats["range"] = (tstats["max"] - tstats["min"])
tstats

,count,mean,std,min,25%,50%,75%,max,range
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75,100.5
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80,8666.0

-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-

In [21]:
iris_df = acquire.get_iris_data()
iris_df.rename(columns = {"species_name":"species"},inplace=True)
iris_df.drop(columns=["species_id","measurement_id"],inplace=True)
iris_dummpy_df = pd.get_dummies(iris_df[["species"]],drop_first=False)
iris_mod_df = pd.concat([iris_df,iris_dummpy_df],axis=1)
iris_mod_df.head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0

In [22]:
titanic_df = acquire.get_titanic_data()
titanic_df.drop(columns=["embarked","pclass"],inplace=True) ## due to dupes
titanic_df.drop(columns=["age","deck"],inplace=True) ##due to nulls
titanic_df.rename(columns = {"class":"class_paid"},inplace=True)
dummy_df = pd.get_dummies(titanic_df[["sex","class_paid","embark_town"]],drop_first=False)
titanic_mod_df = pd.concat([titanic_df,dummy_df],axis=1)
titanic_mod_df.head()

,passenger_id,survived,sex,sibsp,parch,fare,class_paid,embark_town,alone,sex_female,sex_male,class_paid_First,class_paid_Second,class_paid_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
0,0,0,male,1,0,7.2500,Third,Southampton,0,0,1,0,0,1,0,0,1
1,1,1,female,1,0,71.2833,First,Cherbourg,0,1,0,1,0,0,1,0,0
2,2,1,female,0,0,7.9250,Third,Southampton,1,1,0,0,0,1,0,0,1
3,3,1,female,1,0,53.1000,First,Southampton,0,1,0,1,0,0,0,0,1
4,4,0,male,0,0,8.0500,Third,Southampton,1,0,1,0,0,1,0,0,1

In [23]:
titanic_df = acquire.get_titanic_data()
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.5+ KB

In [24]:
telco_churn_df = acquire.get_telco_data()
telco_churn_df.drop(columns=["contract_type_id","internet_service_type_id","payment_type_id"],inplace=True)
telco_churn_df["gender_encoded"] = telco_churn_df.gender.map({"Female":1,"Male":0})
telco_churn_df["partner_encoded"] = telco_churn_df.partner.map({"Yes":1,"No":0})
dummy_df = pd.get_dummies(telco_churn_df,drop_first=False)
telco_churn_mod_df = pd.concat([telco_churn_df,dummy_df],axis=1)
telco_churn_mod_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,contract_type_Month-to-month,contract_type_One year,contract_type_Two year,internet_service_type_DSL,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Bank transfer (automatic),payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,0,1,0,1,0,0,0,0,0,1
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,1,0,0,1,0,0,0,0,0,1
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,1,0,0,0,1,0,0,0,1,0
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,1,0,0,0,1,0,0,0,1,0
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,1,0,0,0,1,0,0,0,0,1

In [25]:
telco_churn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            7043 non-null   object
 1   gender                 7043 non-null   object
 2   senior_citizen         7043 non-null   int64
 3   partner                7043 non-null   object
 4   dependents             7043 non-null   object
 5   tenure                 7043 non-null   int64
 6   phone_service          7043 non-null   object
 7   multiple_lines         7043 non-null   object
 8   online_security        7043 non-null   object
 9   online_backup          7043 non-null   object
 10  device_protection      7043 non-null   object
 11  tech_support           7043 non-null   object
 12  streaming_tv           7043 non-null   object
 13  streaming_movies       7043 non-null   object
 14  paperless_billing      7043 non-null   object
 15  monthly_charges        7043 non-null   float64
 16  total_charges          7043 non-null   object
 17  churn                  7043 non-null   object
 18  contract_type          7043 non-null   object
 19  internet_service_type  7043 non-null   object
 20  payment_type           7043 non-null   object
 21  gender_encoded         7043 non-null   int64
 22  partner_encoded        7043 non-null   int64
dtypes: float64(1), int64(4), object(18)
memory usage: 1.2+ MB

In [26]:
telco_churn_df = acquire.get_telco_data()
pd.crosstab(telco_churn_df.payment_type,telco_churn_df.payment_type_id)

payment_type_id               1     2     3     4
payment_type
Bank transfer (automatic)     0     0  1544     0
Credit card (automatic)       0     0     0  1522
Electronic check           2365     0     0     0
Mailed check                  0  1612     0     0

In [27]:
for col in telco_churn_df.columns:
    print(telco_churn_df[col].value_counts())
    print()

1    2365
2    1612
3    1544
4    1522
Name: payment_type_id, dtype: int64

2    3096
1    2421
3    1526
Name: internet_service_type_id, dtype: int64

1    3875
3    1695
2    1473
Name: contract_type_id, dtype: int64

0002-ORFBO    1
6616-AALSR    1
6625-UTXEW    1
6625-IUTTT    1
6625-FLENO    1
             ..
3352-RICWQ    1
3352-ALMCK    1
3351-NQLDI    1
3351-NGXYI    1
9995-HOTOH    1
Name: customer_id, Length: 7043, dtype: int64

Male      3555
Female    3488
Name: gender, dtype: int64

0    5901
1    1142
Name: senior_citizen, dtype: int64

No     3641
Yes    3402
Name: partner, dtype: int64

No     4933
Yes    2110
Name: dependents, dtype: int64

1     613
72    362
2     238
3     200
4     176
71    170
5     133
7     131
8     123
9     119
70    119
12    117
10    116
6     110
13    109
68    100
15     99
11     99
67     98
18     97
69     95
24     94
22     90
66     89
35     88
17     87
23     85
16     80
56     80
52     80
64     80
25     79
26     79
14     76
65     76
61     76
60     76
46     74
19     73
27     72
29     72
30     72
63     72
20     71
53     70
62     70
41     70
32     69
50     68
54     68
47     68
51     68
58     67
49     66
31     65
43     65
42     65
34     65
57     65
37     65
40     64
48     64
33     64
55     64
21     63
45     61
59     60
38     59
28     57
39     56
44     51
36     50
0      11
Name: tenure, dtype: int64

Yes    6361
No      682
Name: phone_service, dtype: int64

No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64

No                     3498
Yes                    2019
No internet service    1526
Name: online_security, dtype: int64

No                     3088
Yes                    2429
No internet service    1526
Name: online_backup, dtype: int64

No                     3095
Yes                    2422
No internet service    1526
Name: device_protection, dtype: int64

No                     3473
Yes                    2044
No internet service    1526
Name: tech_support, dtype: int64

No                     2810
Yes                    2707
No internet service    1526
Name: streaming_tv, dtype: int64

No                     2785
Yes                    2732
No internet service    1526
Name: streaming_movies, dtype: int64

Yes    4171
No     2872
Name: paperless_billing, dtype: int64

20.05     61
19.85     45
19.95     44
19.90     44
20.00     43
          ..
116.55     1
106.85     1
68.55      1
108.80     1
67.85      1
Name: monthly_charges, Length: 1585, dtype: int64

           11
20.2       11
19.75       9
19.9        8
20.05       8
           ..
2387.75     1
6302.8      1
2058.5      1
829.55      1
3707.6      1
Name: total_charges, Length: 6531, dtype: int64

No     5174
Yes    1869
Name: churn, dtype: int64

Month-to-month    3875
Two year          1695
One year          1473
Name: contract_type, dtype: int64

Fiber optic    3096
DSL            2421
None           1526
Name: internet_service_type, dtype: int64

Electronic check             2365
Mailed check                 1612
Bank transfer (automatic)    1544
Credit card (automatic)      1522
Name: payment_type, dtype: int64

In [28]:
iris_mod2_df=prepare.prep_iris()

In [32]:
prepare.split_function(iris_mod2_df,"species")

prepared df shape: (150, 12)
train shape: (90, 12)
validate shape: (30, 12)
test shape: (30, 12)

(     sepal_length  sepal_width  petal_length  petal_width     species  \
 70            5.9          3.2           4.8          1.8  versicolor
 123           6.3          2.7           4.9          1.8   virginica
 87            6.3          2.3           4.4          1.3  versicolor
 3             4.6          3.1           1.5          0.2      setosa
 15            5.7          4.4           1.5          0.4      setosa
 53            5.5          2.3           4.0          1.3  versicolor
 20            5.4          3.4           1.7          0.2      setosa
 50            7.0          3.2           4.7          1.4  versicolor
 54            6.5          2.8           4.6          1.5  versicolor
 52            6.9          3.1           4.9          1.5  versicolor
 81            5.5          2.4           3.7          1.0  versicolor
 88            5.6          3.0           4.1          1.3  versicolor
 145           6.7          3.0           5.2          2.3   virginica
 130           7.4          2.8           6.1          1.9   virginica
 149           5.9          3.0           5.1          1.8   virginica
 85            6.0          3.4           4.5          1.6  versicolor
 6             4.6          3.4           1.4          0.3      setosa
 31            5.4          3.4           1.5          0.4      setosa
 4             5.0          3.6           1.4          0.2      setosa
 18            5.7          3.8           1.7          0.3      setosa
 92            5.8          2.6           4.0          1.2  versicolor
 74            6.4          2.9           4.3          1.3  versicolor
 139           6.9          3.1           5.4          2.1   virginica
 125           7.2          3.2           6.0          1.8   virginica
 133           6.3          2.8           5.1          1.5   virginica
 100           6.3          3.3           6.0          2.5   virginica
 84            5.4          3.0           4.5          1.5  versicolor
 36            5.5          3.5           1.3          0.2      setosa
 41            4.5          2.3           1.3          0.3      setosa
 91            6.1          3.0           4.6          1.4  versicolor
 108           6.7          2.5           5.8          1.8   virginica
 89            5.5          2.5           4.0          1.3  versicolor
 23            5.1          3.3           1.7          0.5      setosa
 35            5.0          3.2           1.2          0.2      setosa
 137           6.4          3.1           5.5          1.8   virginica
 129           7.2          3.0           5.8          1.6   virginica
 1             4.9          3.0           1.4          0.2      setosa
 16            5.4          3.9           1.3          0.4      setosa
 55            5.7          2.8           4.5          1.3  versicolor
 67            5.8          2.7           4.1          1.0  versicolor
 32            5.2          4.1           1.5          0.1      setosa
 94            5.6          2.7           4.2          1.3  versicolor
 48            5.3          3.7           1.5          0.2      setosa
 25            5.0          3.0           1.6          0.2      setosa
 12            4.8          3.0           1.4          0.1      setosa
 95            5.7          3.0           4.2          1.2  versicolor
 46            5.1          3.8           1.6          0.2      setosa
 43            5.0          3.5           1.6          0.6      setosa
 69            5.6          2.5           3.9          1.1  versicolor
 119           6.0          2.2           5.0          1.5   virginica
 107           7.3          2.9           6.3          1.8   virginica
 140           6.7          3.1           5.6          2.4   virginica
 114           5.8          2.8           5.1          2.4   virginica
 104           6.5          3.0           5.8          2.2   virginica
 61            5.9          3.0           4.2          1.5  versicolor
 26            5.0          3.4           1.6          0.4      setosa
 82            5.8          2.7           3.9          1.2  versicolor
 8             4.4          2.9           1.4          0.2      setosa
 24            4.8          3.4           1.9          0.2      setosa
 51            6.4          3.2           4.5          1.5  versicolor
 115           6.4          3.2           5.3          2.3   virginica
 132           6.4          2.8           5.6          2.2   virginica
 126           6.2          2.8           4.8          1.8   virginica
 128           6.4          2.8           5.6          2.1   virginica
 14            5.8          4.0           1.2          0.2      setosa
 40            5.0          3.5           1.3          0.3      setosa
 59            5.2          2.7           3.9          1.4  versicolor
 109           7.2          3.6           6.1          2.5   virginica
 57            4.9          2.4           3.3          1.0  versicolor
 79            5.7          2.6           3.5          1.0  versicolor
 103           6.3          2.9           5.6          1.8   virginica
 9             4.9          3.1           1.5          0.1      setosa
 7             5.0          3.4           1.5          0.2      setosa
 142           5.8          2.7           5.1          1.9   virginica
 112           6.8          3.0           5.5          2.1   virginica
 73            6.1          2.8           4.7          1.2  versicolor
 83            6.0          2.7           5.1          1.6  versicolor
 111           6.4          2.7           5.3          1.9   virginica
 120           6.9          3.2           5.7          2.3   virginica
 147           6.5          3.0           5.2          2.0   virginica
 131           7.9          3.8           6.4          2.0   virginica
 5             5.4          3.9           1.7          0.4      setosa
 58            6.6          2.9           4.6          1.3  versicolor
 118           7.7          2.6           6.9          2.3   virginica
 141           6.9          3.1           5.1          2.3   virginica
 11            4.8          3.4           1.6          0.2      setosa
 29            4.7          3.2           1.6          0.2      setosa
 96            5.7          2.9           4.2          1.3  versicolor
 44            5.1          3.8           1.9          0.4      setosa
 97            6.2          2.9           4.3          1.3  versicolor

      sepal_length  sepal_width  petal_length  petal_width  species_setosa  \
 70            5.9          3.2           4.8          1.8               0
 123           6.3          2.7           4.9          1.8               0
 87            6.3          2.3           4.4          1.3               0
 3             4.6          3.1           1.5          0.2               1
 15            5.7          4.4           1.5          0.4               1
 53            5.5          2.3           4.0          1.3               0
 20            5.4          3.4           1.7          0.2               1
 50            7.0          3.2           4.7          1.4               0
 54            6.5          2.8           4.6          1.5               0
 52            6.9          3.1           4.9          1.5               0
 81            5.5          2.4           3.7          1.0               0
 88            5.6          3.0           4.1          1.3               0
 145           6.7          3.0           5.2          2.3               0
 130           7.4          2.8           6.1          1.9               0
 149           5.9          3.0           5.1          1.8               0
 85            6.0          3.4           4.5          1.6               0
 6             4.6          3.4           1.4          0.3               1
 31            5.4          3.4           1.5          0.4               1
 4             5.0          3.6           1.4          0.2               1
 18            5.7          3.8           1.7          0.3               1
 92            5.8          2.6           4.0          1.2               0
 74            6.4          2.9           4.3          1.3               0
 139           6.9          3.1           5.4          2.1               0
 125           7.2          3.2           6.0          1.8               0
 133           6.3          2.8           5.1          1.5               0
 100           6.3          3.3           6.0          2.5               0
 84            5.4          3.0           4.5          1.5               0
 36            5.5          3.5           1.3          0.2               1
 41            4.5          2.3           1.3          0.3               1
 91            6.1          3.0           4.6          1.4               0
 108           6.7          2.5           5.8          1.8               0
 89            5.5          2.5           4.0          1.3               0
 23            5.1          3.3           1.7          0.5               1
 35            5.0          3.2           1.2          0.2               1
 137           6.4          3.1           5.5          1.8               0
 129           7.2          3.0           5.8          1.6               0
 1             4.9          3.0           1.4          0.2               1
 16            5.4          3.9           1.3          0.4               1
 55            5.7          2.8           4.5          1.3               0
 67            5.8          2.7           4.1          1.0               0
 32            5.2          4.1           1.5          0.1               1
 94            5.6          2.7           4.2          1.3               0
 48            5.3          3.7           1.5          0.2               1
 25            5.0          3.0           1.6          0.2               1
 12            4.8          3.0           1.4          0.1               1
 95            5.7          3.0           4.2          1.2               0
 46            5.1          3.8           1.6          0.2               1
 43            5.0          3.5           1.6          0.6               1
 69            5.6          2.5           3.9          1.1               0
 119           6.0          2.2           5.0          1.5               0
 107           7.3          2.9           6.3          1.8               0
 140           6.7          3.1           5.6          2.4               0
 114           5.8          2.8           5.1          2.4               0
 104           6.5          3.0           5.8          2.2               0
 61            5.9          3.0           4.2          1.5               0
 26            5.0          3.4           1.6          0.4               1
 82            5.8          2.7           3.9          1.2               0
 8             4.4          2.9           1.4          0.2               1
 24            4.8          3.4           1.9          0.2               1
 51            6.4          3.2           4.5          1.5               0
 115           6.4          3.2           5.3          2.3               0
 132           6.4          2.8           5.6          2.2               0
 126           6.2          2.8           4.8          1.8               0
 128           6.4          2.8           5.6          2.1               0
 14            5.8          4.0           1.2          0.2               1
 40            5.0          3.5           1.3          0.3               1
 59            5.2          2.7           3.9          1.4               0
 109           7.2          3.6           6.1          2.5               0
 57            4.9          2.4           3.3          1.0               0
 79            5.7          2.6           3.5          1.0               0
 103           6.3          2.9           5.6          1.8               0
 9             4.9          3.1           1.5          0.1               1
 7             5.0          3.4           1.5          0.2               1
 142           5.8          2.7           5.1          1.9               0
 112           6.8          3.0           5.5          2.1               0
 73            6.1          2.8           4.7          1.2               0
 83            6.0          2.7           5.1          1.6               0
 111           6.4          2.7           5.3          1.9               0
 120           6.9          3.2           5.7          2.3               0
 147           6.5          3.0           5.2          2.0               0
 131           7.9          3.8           6.4          2.0               0
 5             5.4          3.9           1.7          0.4               1
 58            6.6          2.9           4.6          1.3               0
 118           7.7          2.6           6.9          2.3               0
 141           6.9          3.1           5.1          2.3               0
 11            4.8          3.4           1.6          0.2               1
 29            4.7          3.2           1.6          0.2               1
 96            5.7          2.9           4.2          1.3               0
 44            5.1          3.8           1.9          0.4               1
 97            6.2          2.9           4.3          1.3               0

      species_versicolor  species_virginica
 70                    1                  0
 123                   0                  1
 87                    1                  0
 3                     0                  0
 15                    0                  0
 53                    1                  0
 20                    0                  0
 50                    1                  0
 54                    1                  0
 52                    1                  0
 81                    1                  0
 88                    1                  0
 145                   0                  1
 130                   0                  1
 149                   0                  1
 85                    1                  0
 6                     0                  0
 31                    0                  0
 4                     0                  0
 18                    0                  0
 92                    1                  0
 74                    1                  0
 139                   0                  1
 125                   0                  1
 133                   0                  1
 100                   0                  1
 84                    1                  0
 36                    0                  0
 41                    0                  0
 91                    1                  0
 108                   0                  1
 89                    1                  0
 23                    0                  0
 35                    0                  0
 137                   0                  1
 129                   0                  1
 1                     0                  0
 16                    0                  0
 55                    1                  0
 67                    1                  0
 32                    0                  0
 94                    1                  0
 48                    0                  0
 25                    0                  0
 12                    0                  0
 95                    1                  0
 46                    0                  0
 43                    0                  0
 69                    1                  0
 119                   0                  1
 107                   0                  1
 140                   0                  1
 114                   0                  1
 104                   0                  1
 61                    1                  0
 26                    0                  0
 82                    1                  0
 8                     0                  0
 24                    0                  0
 51                    1                  0
 115                   0                  1
 132                   0                  1
 126                   0                  1
 128                   0                  1
 14                    0                  0
 40                    0                  0
 59                    1                  0
 109                   0                  1
 57                    1                  0
 79                    1                  0
 103                   0                  1
 9                     0                  0
 7                     0                  0
 142                   0                  1
 112                   0                  1
 73                    1                  0
 83                    1                  0
 111                   0                  1
 120                   0                  1
 147                   0                  1
 131                   0                  1
 5                     0                  0
 58                    1                  0
 118                   0                  1
 141                   0                  1
 11                    0                  0
 29                    0                  0
 96                    1                  0
 44                    0                  0
 97                    1                  0  ,
      sepal_length  sepal_width  petal_length  petal_width     species  \
 80            5.5          2.4           3.8          1.1  versicolor
 45            4.8          3.0           1.4          0.3      setosa
 144           6.7          3.3           5.7          2.5   virginica
 110           6.5          3.2           5.1          2.0   virginica
 38            4.4          3.0           1.3          0.2      setosa
 2             4.7          3.2           1.3          0.2      setosa
 135           7.7          3.0           6.1          2.3   virginica
 72            6.3          2.5           4.9          1.5  versicolor
 138           6.0          3.0           4.8          1.8   virginica
 34            4.9          3.1           1.5          0.2      setosa
 19            5.1          3.8           1.5          0.3      setosa
 77            6.7          3.0           5.0          1.7  versicolor
 101           5.8          2.7           5.1          1.9   virginica
 63            6.1          2.9           4.7          1.4  versicolor
 117           7.7          3.8           6.7          2.2   virginica
 76            6.8          2.8           4.8          1.4  versicolor
 42            4.4          3.2           1.3          0.2      setosa
 22            4.6          3.6           1.0          0.2      setosa
 28            5.2          3.4           1.4          0.2      setosa
 33            5.5          4.2           1.4          0.2      setosa
 17            5.1          3.5           1.4          0.3      setosa
 116           6.5          3.0           5.5          1.8   virginica
 127           6.1          3.0           4.9          1.8   virginica
 56            6.3          3.3           4.7          1.6  versicolor
 105           7.6          3.0           6.6          2.1   virginica
 146           6.3          2.5           5.0          1.9   virginica
 93            5.0          2.3           3.3          1.0  versicolor
 86            6.7          3.1           4.7          1.5  versicolor
 68            6.2          2.2           4.5          1.5  versicolor
 65            6.7          3.1           4.4          1.4  versicolor

      sepal_length  sepal_width  petal_length  petal_width  species_setosa  \
 80            5.5          2.4           3.8          1.1               0
 45            4.8          3.0           1.4          0.3               1
 144           6.7          3.3           5.7          2.5               0
 110           6.5          3.2           5.1          2.0               0
 38            4.4          3.0           1.3          0.2               1

In [29]:
train_iris,test_iris,validate_iris = prepare.split_function(iris_mod_df,"species")

prepared df shape: (150, 8)
train shape: (90, 8)
validate shape: (30, 8)
test shape: (30, 8)

In [30]:
train_titanic,test_titanic,validate_titanic = prepare.split_function(titanic_mod_df,"survived")

prepared df shape: (891, 17)
train shape: (534, 17)
validate shape: (178, 17)
test shape: (179, 17)

In [31]:
train_telco,test_telco,validate_telco = prepare.split_function(telco_churn_mod_df,"churn")

prepared df shape: (7043, 13645)
train shape: (4225, 13645)
validate shape: (1409, 13645)
test shape: (1409, 13645)

-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-
-

Tidy data - correct place and right build

wide data --> long data (melt) df.melt() gets values out of columns
long data --> wide data (pivot_table, unstack)

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:


name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: grade, dtype: float64

In [55]:
sql_query = """
                SELECT * 
                FROM attendance
                ;
                """
attendance_df = pd.read_sql(sql_query,env.get_db_url("tidy_data"))
attendance_df ## P-present, A-absent, T-tardy, H-half day

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [76]:
attn_df = attendance_df.replace({"P":1,"T":.9,"A":0,"H":.5})

attn_df = attn_df.melt(id_vars="Unnamed: 0",var_name="Date",value_name="Atten_value")

attn_df.groupby(["Unnamed: 0"]).mean()

            Atten_value
Unnamed: 0
Billy            0.5250
Jane             0.6875
John             0.9125
Sally            0.7625

Coffee Levels

Read the coffee_levels table.
Transform the data so that each carafe is in it's own column.
Is this the best shape for the data?

In [77]:
sql_query = """
                SELECT * 
                FROM coffee_levels
                ;
                """
coffee_levels_df = pd.read_sql(sql_query,env.get_db_url("tidy_data"))
coffee_levels_df ## three carafe options, dispensed at different times and different amounts?

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947
25    13             z       0.398520
26    14             z       0.864464
27    15             z       0.436364
28    16             z       0.280621
29    17             z       0.436677

In [80]:
coffee_tidy = coffee_levels_df.pivot_table(index = ['hour'],
                                       columns= 'coffee_carafe', 
                                       values = 'coffee_amount').reset_index()
coffee_tidy ## defintely seems like a better way to look at it

coffee_carafe  hour         x         y         z
0                 8  0.816164  0.189297  0.999264
1                 9  0.451018  0.521502  0.915990
2                10  0.843279  0.023163  0.144928
3                11  0.335533  0.235529  0.311495
4                12  0.898291  0.017009  0.771947
5                13  0.310711  0.997464  0.398520
6                14  0.507288  0.058361  0.864464
7                15  0.215043  0.144644  0.436364
8                16  0.183891  0.544676  0.280621
9                17  0.391560  0.594126  0.436677

Cake Recipes

 Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.

 Tidy the data as necessary.
 
 Which recipe, on average, is the best? recipe b

 Which oven temperature, on average, produces the best results? 275

 Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [81]:
sql_query = """
                SELECT * 
                FROM cake_recipes
                ;
                """
cake_recipes_df = pd.read_sql(sql_query,env.get_db_url("tidy_data"))
cake_recipes_df ## values are tastiness scores

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [118]:
cake_recipes_df[['recipe', 'position']] = cake_recipes_df["recipe:position"].str.split(':', expand = True)
cake_df = cake_recipes_df.drop(columns={"recipe:position"})
cake_df = cake_df.melt(id_vars = ['recipe',"position"],var_name="temp",value_name="taste_score")
print("best recipe", cake_df.groupby("recipe").mean().idxmax())
print("best temp", cake_df.groupby("temp").mean().idxmax())
print("best combination", cake_df.groupby(["recipe","position","temp"]).mean().idxmax())
cake_df.head()

best recipe taste_score    b
dtype: object
best temp taste_score    275
dtype: object
best combination taste_score    (b, bottom, 300)
dtype: object

  recipe position temp  taste_score
0      a   bottom  225    61.738655
1      a      top  225    51.709751
2      b   bottom  225    57.095320
3      b      top  225    82.455004
4      c   bottom  225    96.470207